---
title: UpdaterId
classe: Autodesk.Revit.DB.UpdaterId
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# UpdaterId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `updaterId.IsValidObject` | Boolean |
| `Void Dispose()` | `updaterId.Dispose()` | Void |
| `AddInId GetAddInId()` | `updaterId.GetAddInId()` | AddInId |
| `Guid GetGUID()` | `updaterId.GetGUID()` | Guid |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```